src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8bd9f000-83c9-4a48-8166-2691b6f02183">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ax_УС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_ЗавозТребуетсяДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_КомментарийСклад</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="22123465-b48b-4cb0-9380-1ebabf57bf68">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1202ab1f-3fcc-44a5-9442-3a45f587685d">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6b39f22-3d0b-4d48-8610-f5b36bbaebc8">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="06fbccda-70c8-41aa-84e7-f19b55ac0e9c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c8075b9-6faf-40af-9bf1-578aeda55fa8">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="595aeccc-8e6d-4e20-a5fd-69789d5828b2">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="471944dc-2671-4919-885b-04db2c14d1cb">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10699bb8-b685-49df-b889-e56f9cb3a64d">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d121ce6-6d64-46b8-994d-69e60ed91a43">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79cb27a7-2b14-4398-bf17-b88ef2c2a649">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b8c80711-6733-448b-8920-77bb0040b510">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2dc068b6-bb1b-4722-a4d5-7e1d1e718f32">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="78c21b30-8148-410f-91b7-6ee155fd8c63">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c8ea180-fa43-4221-a017-fbf8586574b8">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="48b02061-bc07-47e4-b621-d91cf421f3dd">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="dcee393b-d797-4bfd-be64-3bc288149128">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9dcfc241-72d7-4f32-8087-92a6267c3254">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2f4b8512-8323-4b3a-b0bb-070f2e6902e5">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d5c49e21-5bf7-455f-9a48-c335091099d2">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8a5b2ff1-9253-46ce-be3f-1ffa9c7e158e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4a0c867-ed8f-4f26-8569-60699f276db6">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f930a54f-5245-488c-9dad-78b6e73e5ad8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a928dbc-667f-45c6-b2d7-1eb2b3c6bc1e">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b3962642-ba24-4ef8-8f01-0be5b88a6f15">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="668ed00b-296c-4f7c-9a8d-2c0af1327f1b">
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	ЭлементГруппаОсновное = Элементы.Найти("ГруппаОсновное");
	
	ГруппаПараметрыОбменаОсновная = Элементы
		.Добавить("ax_ГруппаПараметрыОбменаОсновная", Тип("ГруппаФормы"), ЭлементГруппаОсновное);
	ГруппаПараметрыОбменаОсновная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПараметрыОбменаОсновная.ОтображатьЗаголовок = Истина;
	ГруппаПараметрыОбменаОсновная.Заголовок = "ТД Форт (параметры обмена с WMS)";
	ГруппаПараметрыОбменаОсновная.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ГруппаПараметрыОбменаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПараметрыОбменаОсновная.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементыУС = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементыУС.ПутьКДанным = "Объект.ax_УС";
	ЭлементыУС.Видимость = Истина;
	ЭлементыУС.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементыУС.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементыУС.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементыУС.Заголовок = "Отправить в УС";
	ЭлементыУС.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементТребуетсяДоставка = Элементы
		.Добавить("ax_ЗавозТребуетсяДоставка", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементТребуетсяДоставка.ПутьКДанным = "Объект.ax_ЗавозТребуетсяДоставка";
	ЭлементТребуетсяДоставка.Видимость = Истина;
	ЭлементТребуетсяДоставка.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементТребуетсяДоставка.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.Заголовок = "Требуется доставка";
	ЭлементТребуетсяДоставка.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
		
	ЭлементКомментарийСклад = Элементы
		.Добавить("ax_КомментарийСклад", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементКомментарийСклад.ПутьКДанным = "Объект.ax_КомментарийСклад";
	ЭлементКомментарийСклад.Видимость = Истина;
	ЭлементКомментарийСклад.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКомментарийСклад.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.Заголовок = "Комментарий для склада";
	ЭлементКомментарийСклад.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх; 
	ЭлементКомментарийСклад.РастягиватьПоГоризонтали = Истина;
	ЭлементКомментарийСклад.МногострочныйРежим = Истина;
	ЭлементКомментарийСклад.Ширина = 76;
		
КонецПроцедуры
